Tekla.Structures.Model.Reinforcement.RebarGeometrySimplificationTypeEnum
The rebar geometry simplification type.

Tekla.Structures.Model.Reinforcement.RebarGeometrySimplificationTypeEnum.NONE
No simplification.

Tekla.Structures.Model.Reinforcement.RebarGeometrySimplificationTypeEnum.RATIONALIZED
Rationalized geometry - includes segmented arcs converted to true arcs by Rebar Shape Recognition.

Tekla.Structures.Model.Reinforcement.RebarGeometrySimplificationTypeEnum.FABRICATION
Fabrication geometry - includes arcs recognized as straight by Rebar Shape Recognition.